import pygame




story = {
	"warriors": ["εισαι ενας πολεμιστης, ο καλυτερος του βασιλειου, σου εχει ανατεθει να εξερυνησεις μια μεχρι στιγμης αγνωστη περιοχη", None, None],
	"warrior0": ["Ειναι ενα χειμωνιατικο βραδυ, εισαι στη ταβερνα του κυρ Βασιλη και απολαμβανεις το ποτο σου με λιγο ψωμι. Ξαφνικα σε πλησιαζει ενας μυστηριωδης τυπος με κουκουλα και προσπαθει να σου μιλησει", "μιλας", "δε μιλας"],
	"warrior00": ["αποφασισες να του μιλησεις και φαινεται πως εχετε κοινη γνωμη σε πολλα θεματα. Μετα απο λιγο φευγει και εσυ νιωθεις αναλαφρος, τοσο ψυχικα οσο και σωματικα. Σου εχει παρει το πορτοφολι", "κυνηγας", "δε κυνηγας"],
	"warrior01": ["τον αγνοεις, πινεις πληρωνεις και φευγεις, η πριγκιπισσα σου εχει αναθεσει μια αποστολη για εξερυνηση και δεν εχεις καιρο για χασιμο, ποτε ξεκινας;", "τωρα", "μολις ξημερωσει"],
	"warrior000": ["Ο μυστηριωδης αντρας εχει φυγει απο τη ταβερνα, τον κυνηγας και τελικα τον πιανεις και τον ριχνεις κατω. Πας να τον χτυπησεις και να παρεις το πορτοφολι σου αλλα σου ζηταει να περιμενεις, τι κανεις;", "περιμενεις", "δε περιμενεις"],
	"warrior001": ["φευγεις απο τη ταβερνα μεθυσμενος και αποφασιζεις να πας μια βολτα. Πας απ το δασος ή απο το ποταμι;", "δασος", "ποταμι"],
	"warrior010": ["αποφασιζεις να ξεκινησεις τωρα, αλλα ειναι σκοταδι και πολλοι πλανωδιοι καραδοκουν, υπαρχει περιπτωση να τους πετυχεις.. Και οντως τους πετυχαινεις, ειναι 4. Τους πολεμας ή τρεχεις;", "πολεμας", "τρεχεις"],
	"warrior011": ["φευγεις, κοιμασαι. Ξημερωνει και ξεκινας το ταξιδι σου. Βρισκεις τη σπηλια που σου ειπε η πριγκιπισσα αλλα νιωθεις καποιον να πλησιαζει. Τον αγνοεις και μπαινεις στη σπηλια ή περιμενεις και βλεπεις τι θελει;", "συνεχιζεις", "περιμενεις"],
	"warrior0000": ["Περιμενεις να ακουσεις τι θα πει. Σου μιλαει για το σχεδιο που εχει να απαγαγει τη πριγκιπισσα και να γινει πλουσιος, σου ζηταει να τον βοηθησεις και να μοιραστειτε τα κερδη. Τον βοηθας;", "ναι", "οχι"],
	"warrior0001": ["Αποφασιζεις να του σπασεις τα μουτρα και να παρεις πισω αυτο που σου ανηκει. Ερχονται οι φρουροι να δουν τι συμβαινει. Λες την αληθεια και τον αφηνεις να σαπισει στη φυλακη ή λες ψεματα για να γλιτωσει αφου η ποινη θα ειναι πολυ σκληρη αλλιως", "αληθεια", "ψεματα"],
	"warrior0010": ["αποφασιζεις να πας απ το δασος, ειναι ομως σκοτεινος και περιεργος ο δρομος, χανεσαι και δε ξερεις που εισαι. Συνεχιζεις να εξερευνεις μπας και βρεις την εξοδο ή αναβεις φωτια και περιμενεις το πρωι;", "συνεχιζεις", "σταματας"],
	"warrior0011": ["αποφασιζεις να πας απ το ποταμι. Ξαφνικα ομως γλιστρας και πεφτεις μεσα, το ρεμα σε παρασυρει. Προσπαθεις να πιαστεις απο βραχο ή βουτας για να μειωσεις την ορμη;", "πιανεσαι", "βουτας"],
	"warrior0100": ["Αποφασιζεις να τους πολεμησεις, τα χρονια εμπειριας σου φαινονται και τους νικας ευκολα. Το βαζουν στα ποδια και τρεχουν προς τη πολη. Τους κυνηγας ή συνεχιζεις;", "κυνηγας", "συνεχιζεις"],
	"warrior0101": ["αποφασιζεις να τρεξεις, δεν θα ηταν σοφο να πολεμησεις. Τους εχασες αλλα τωρα εχεις αλλο προβλημα. Σε βρηκε μια αρκουδα, αν και κουρασμενος, πολεμας ή τρεχεις παλι;", "πολεμας", "τρεχεις"],
	"warrior0110": ["Συνεχιζεις και μπαινεις στη σπηλια, εξερευνωντας σιγα σιγα βρισκεις ενα παλιο σεντουκι, εισαι ετοιμος να το ανοιξεις αλλα ξερεις οτι ακομα καποιος ειναι πισω σου. Το ανοιγεις ετσι κι αλλιως ή γυρνας αποτομα και ορμας σε οποιον ειναι πισω σου;", "ανοιγεις", "γυρνας"],
	"warrior0111": ["περιμενεις, τελικα ειναι ενας μαγος, ισως μπορει να σε βοηθησει να αντιμετωπισεις τα μυστικα της σπηλιας, ισως θελει ομως τον μισο θησαυρο. Τον διωχνεις ή του λες να σε ακολουθησει;", "να ερθει", "να φυγει"],
	"warrior00000": ["Αποφασιζεις να τον βοηθησεις. Ξεκινατε προς το βασιλειο και βαζετε σε εφαρμογη το σχεδιο. Βεβαια, δυστυχως ξεχασες να ρωτησεις ποιο ειναι αυτο το σχεδιο. Τελικα ηθελε να ντυθειτε φρουροι και να περασετε και καλα απαρατηρητοι. Προφανως δεν επιασε, σας καταλαβαν και τωρα περνατε τις μερες σας στην εξορια", None, None],
	"warrior00001": ["Αποφασιζεις να μην τον βοηθησεις, ειναι πολυ ριψοκινδυνο. Τον σαπιζεις στις ψιλες και φευγεις. Λιγες μερες μετα ακους για εναν περιεργο τυπα με μαυρισμενο ματι που απειγαγε την πριγκιπισσα και εγινε βασιλιας. Ατυχια..", "", ""],
	"warrior00010": ["Αποφασιζεις να πεις την αληθεια, σε εκλεψε και πρεπει να τιμωρηθει. Παει φυλακη για χρονια αλλα τον λυπασαι και του πηγαινεις φαγητο που και που. Μιλατε και τελικα μοιαζεται πιο πολυ απ ο,τι νομιζατε, γινεστε καλοι φιλοι. Εκλεισες τον κολλητο σου φυλακη..Συγχαρητηρια...", "", ""],
	"warrior00011": ["Αποφασιζεις να πεις ψεματα οτι παιζετε, ναι σε εκλεψε αλλα δεν αξιζει τετοια τιμωρια για κατι τοσο μικρο..Σε ευχαριστει σιγκινημενος, τελικα πατε πισω στο μαγαζι και σε κερναει μπυρες...με τα δικα σου λεφτα....", "", ""],
	"warrior00100": ["Συνεχιζεις να προχωρας ευθεια, καποια στιγμη σιγουρα θα βρεις την εξοδο. Και τη βρισκεις..αλλα τελικα εισαι πισω στην αρχη, εκει που ξεκινησες. Σε βλεπουν καποιοι και ντρεπεσαι που χαθηκες οποτε τους λες οτι το δασος ειναι μαγεμενο και οποιος μπει παντα χανει το δρομο και γυρναει πισω. Κανεις δε ξαναπατησε σε εκεινο το δασος απο τοτε, μπραβο", "", ""],
	"warrior00101": ["Τελικα σταματας εκει που εισαι και αναβεις φωτια, κοιμασαι μεχρι να ερθει το πρωι. Τελικα ξεχνας οτι ηθελες να περασεις το δασος και περνας την υπολοιπη ζωη σου εκει, παρεα με τους λαγους και τους σκιουρους. Ο εξω κοσμος νομιζει οτι καποιο τρομερο τερας ζει μεσα στο δασος και για αυτο δε γυρισες, μπραβο", "", ""],
	"warrior00110": ["Αποφασιζεις να πιαστεις απο εναν βραχο και το κανεις. Πας να φυγεις αλλα δε μπορεις, αυτος ο βραχος σου εσωσε τη ζωη, δε μπορεις να τον αφησεις πισω, εισαι δεμενος μαζι του. Τον σπας και τον παιρνεις μαζι σου. Μολις απεκτησες εναν καλο φιλο και συντροφο στη μαχη, τον Rocky (πετρας)", "", ""],
	"warrior00111": ["Αποφασιζεις να βουτηξεις να σωθεις, κατι παει λαθος ομως και βουτας πολυ βαθια. Μεχρι να βγεις εξω εχεις φτασει πολυ μακρια, εισαι σε ενα αγνωστο μερος. Συγχαρητηρια, μολις ανακαλυψες τις Ινδιες. Κριμα που δε ξερεις πως να γυρισεις πισω. Περνας την υπολοιπη ζωη σου ζωγραφιζοντας αγελαδες στο χωμα", "", ""],
	"warrior01000": ["Τους κυνηγας μεχρι την πολη αλλα συνειδητοποιεις οτι σ'αρεσει αυτο. Τους αφηνεις λιγο χρονο και συνεχιζεις να τους κυνηγας. Περνας την υπολοιπη ζωη σου κυνηγοντας μικρους και μεγαλους απλα εχει πλακα. Εισαι πλεον γνωστος ως 'Γιαννης ο τρεχτης'", "", ""],
	"warrior01001": ["Αποφασιζεις να συνεχισεις το ταξιδι σου. Οταν επιτελους γυρνας ακουγονται παντου ιστοριες και φημες για τη δυναμη και τα κατορθωματα σου, εξ αιτιας των πλανωδιων. Περνας την υπολοιπη ζωη σου ως ο δυνατοτερος πολεμιστης του βασιλειου", "", ""],
	"warrior01010": ["Αποφασιζεις να πολεμησεις. Δεν ειναι και η καλυτερη ιδεα..κανεις τον ψοφιο κι οταν δεν το περιμενει τη χτυπας στο σαγονι. Πεφτει κατω, κανει τη ψοφια και οταν δε το περιμενεις σου ορμαει. Πεφτεις κατω, κανεις το ψοφιο και την χτυπας στα ξαφνικα. Πεφτει και κανει τη ψοφια. Κανετε αυτο το προγραμμα απο τοτε που θυμασαι τον εαυτο σου..", "", ""],
	"warrior01011": ["Δεν εχεις ελπιδα να κερδισεις την αρκουδα. Αποφασιζεις να τρεξεις. Οπως τρεχεις βρισκεις τους πλανωδιους, τους βλεπει η αρκουδα και περνει αυτους στο κυνηγι. Συνεχιζεις το μεγαλο σου ταξιδι ανενοχλητος και δε γυρνας ποτε πισω.", "", ""],
	"warrior01100": ["Το ανοιγεις και μενεις εκπληκτος απο το εσωτερικο του. Νιωθεις τον τυπο πισω σου να πλησιαζει αλλα σηκωνεσαι ορθιος και τον σταματας επι τοπου. Του δινεις το ενα απο τα δυο αντικειμενα που ειχε το σεντουκι. Ειναι δυο γεματα νεροπιστολα και παιζετε με αυτα μεχρι να βραδιασει. Πραγματικος θησαυρος", "", ""],
	"warrior01101": ["Θες να γυρισεις να του ορμισεις για να εχεις το θησαυρο δικο σου. Σου ερχεται ιδεα. Του πετας το σεντουκι στο κεφαλι να λυποθυμησει. Αυτος πιανει το σεντουκι και τρεχει μακρια με το θησαυρο..Πολυ καλη ιδεα....", "", ""],
	"warrior01110": ["Του λες να ερθει μαζι σου. Βρισκετε τον θησαυρο αλλα πρεπει να βρεις τον κωδικο του σεντουκιου. Μπορει να σε βοηθησει ο μαγος να διαβασεις τη ξενη αυτη γλωσσα αλλα θελει το μισο θησαυρο. Τελικα απλα το κοιτουσες αναποδα..ωραια ξενη γλωσσα...", "", ""],
	"warrior01111": ["Του λες να μην ερθει, αυτος το παιρνει κατακαρδα και βλεπεις οτι ειναι στεναχωρημενος. Τον παρηγορεις, πηγαινετε για τσαι και κουλουρακια συκωτιου και ξεχνας για τη σπηλια. Ποιος θα ελεγε οχι στα κουλουρακια συκωτιου αλλωστε", "", ""],
	"princesss": ["εισαι μια πριγκιπισσα, εχεις αναλαβει το θρονο του βασιλειου και μελημα σου ειναι να δινεις διαταγες ενω τρως τα σταφυλακια σου", None, None],
	"princess0": ["Ολοκληρο το βασιλειο ειναι δικο σου, η δουλεια σου ομως ειναι πιο κουραστικη και βαρετη απο ο,τι φαινεται. Ασχολεισαι ενεργα με τα προβληματα του βασιλειου ή στελνεις τους φρουρους σου να το κανουν για σενα;", "ασχολεισαι", "φρουροι"],
	"princess00": ["Ανακαλυπτεις απο εγκυρη πηγη οτι το βασιλειο θα δεχθει επιθεση συντομα. Καλεις πισως ολους τους πολεμιστες που εχεις στειλει σε αποστολη ή αμυνεσαι με οσους σου εχουν μεινει;", "καλεις", "αμυνεσαι"],
	"princess01": ["Οι φρουροι σου εχουν φυγει και επικρατει ησυχια. Ξαφνικα νιωθεις ενα δυνατο πονο στο κεφαλι και λυποθυμας. Ξυπνας δεμενη σε μια καλυβα, ενας τυπος με κουκουλα σε κοιταει. Φωναζεις για βοηθεια ή διαπραγματευεσαι την ελευθερια σου;", "φωναζεις", "διαπραγματευεσαι"],
	"princess000": ["Αποφασιζεις και στελνεις αγγελιαφορους να φερουν πισω τους πολεμιστες σου. Οι εχθροι το περιμεναν και τους πιανουν αιχμαλωτους. Πολεμας με τα λιγοστα ατομα που σου εχουν μεινει ή παραδινεσαι για να σωσεις το λαο σου;", "πολεμας", "παραδινεσαι"],
	"princess001": ["Αποφασιζεις να αμυνθεις, ο εχθρος εχει πιο μεγαλο στρατο αλλα οι πολεμιστες σου ειναι πιο εμπειροι. Ειναι ομως φοβισμενοι. Δινεις παθιασμενο λογο ή τρεχεις να κρυφτεις στο δωματιο σου;", "λογος", "κρυβεσαι"],
	"princess010": ["Αρχιζεις και φωναζεις αλλα ξερεις οτι κανεις δε σε ακουει, ξαφνικα αλλος ενας μεγαλοσωμος τυπος ερχεται στο δωματιο. Σου ζητανε να τον κανεις βασιλια αν θες να ζησεις. Τι απαντας;", "ναι", "οχι"],
	"princess011": ["Αρχιζεις και διαπραγματευεσαι, σιγα σιγα και με μικρες προσφορες για αρχη. Το κανεις για να κερδισεις χρονο, ξερεις οτι θα σε βρουν οι φρουροι σου αφου εβαλες 42 κιλα κολωνια σημερα. Ξαφνικα ακους φωνες απ εξω, ηρθαν. Συνεχιζεις το σχεδιο σου ή φωναζεις για να σε ακουσουν;", "συνεχιζεις", "φωναζεις"],
	"princess0000": ["αποφασιζεις να πολεμησεις. Αλλα οι υπεραριθμοι εχθροι σας νικανε και σας πιανουν αιχμαλωτους με ευκολια. Θα σας αφησουν να ζησετε αν τους δωσετε το βασιλειο, τους το δινεις ή αρνεισαι;", "δινεις", "αρνεισαι"],
	"princess0001": ["Σηκωνεις λευκη σημαια και παραδινεσαι. Ομως ενα εχθρικο βελος ξεφυγε και χτυπησε εναν στρατιωτη σου. Η οργη σε κυριευει. Ηρεμεις και συνεχιζεις ή διαταζεις να ξεχυθει ο λαος στη μαχη;", "ηερμεις", "διαταζεις"],
	"princess0010": ["αποφασιζεις να βγαλεις λογο, εισαι φοβισμενη αλλα δε θες να το δειξεις. Δινει τον καλυτερο λογο που εχει ειπωθει τα τελευταια χρονια και οι πολεμιστες σου ξεχινωνται στη μαχη, εσυ τι κανεις; πολεμας μαζι τους ή κοιτας τη μαχη;", "πολεμας", "κοιτας"],
	"princess0011": ["αποφασιζεις να κρυφτεις, σε βλεπουν οι πολεμιστες σου και αποσυντονιζονται, κλεινεσαι στο δωματιο σου και ακους τη φασαρια οσο το βασιλειο σου κυριευεται. Καποιος χτυπαει τη πορτα. Ανοιγεις ή την αφηνεις κλειστη;", "ανοιγεις", "δεν ανοιγεις"],
	"princess0100": ["Αποφασιζεις να δεχθεις τη προταση του και να πεις οτι θα τον κανεις βασιλια, ωστε να ριξουν τις αμυνες τους και να τους επιτεθεις τοτε. Σε ελευθερωνουν και εχεις ενα μαχαιρι στη τσεπη σου. Επιτιθεσαι ή περιμενεις;", "επιτιθεσαι", "περιμενεις"],
	"princess0101": ["απαντας οχι. Δε τους αρεσει η απαντηση σου και φαινεται. Θες να βρεις μια λυση, μπορεις να τους πεις να τους δωσεις λεφτα και εκτασεις και αλογα ή να τους κανεις ιπποτες. Τι επιλεγεις;", "αγαθα", "ιπποτες"],
	"princess0110": ["συνεχιζεις να διαπραγματευεσαι μεχρι να ερθουν. Τελικα δεν ηρθαν ποτε κι εσυ εχεις πιασει μια πολυ ωραια κουβεντα, ξεχαστηκες...Τι κανεις; συνεχιζεις τη κουβεντα ή φωναζεις για να γυρισουν πισω οι φυλακες;", "συνεχιζεις", "φωναζεις"],
	"princess0111": ["φωναζεις, σε ακουνε οι τυποι απ εξω και μπαινουν μεσα. Ηταν οντως οι φρουροι τελικα και ακινητοποιουν τους εγκληματιες. Απαιτεις να πανε στο μπουντρουμι αλλα θελουν πρωτα να σου μιλησουν", "ακους", "δεν ακους"],
	"princess00000": ["Αποφασιζεις να το δωσεις για χαρη του λαου σου. Τελικα ο 'εχθρος' ειναι πολυ εξελιγμενος σε θεματα οργανωσης και διοικησης και το βασιλειο ειναι καλυτερα απο οσο θα μπορουσες να το κανεις ποτε. Ισως να μην ησουν και η καλυτερη ηγετιδα αλλα τουλαχιστον εισαι πιο ομορφη απο αυτους", "", ""],
	"princess00001": ["Αποφασιζεις να αρνηθεις, περιμενεις βοηθεια απο τον βορα με τον καλυτερο σου πολεμιστη να τους οδηγει. Επιτελους φτανουν! Αλλα κατατροπωνονται μεσα σε κυριολεκτικα τρια δευτερολεπτα και περνατε ολη την υπολοιπη ζωη σας σε ενα μπουντρουμι. Συγχαρητηρια...", "", ""],
	"princess00010": ["συνεχιζεις να προχωρας, εμφανως εξοργισμενη, φαινεται σαν να εισαι ετοιμη να εκτοξευσεις φωτιες απ το στομα σου. Τελικα οντως το κανεις, καταλαθος. Ολος ο εχθρικος στρατος εγινε σταχτη. Τελικα εχεις πιο πολλα ταλεντα απ ο,τι νομιζες", "", ""],
	"princess00011": ["Διαταζεις τον στρατο σου να επιτεθει και ξεχυνεστε σαν λυσασμενα σκυλια στο πεδιο της μαχης. Δε βλεπεις συχνα τετοια ανδρεια και θαρος. Τελικα ετσι κι αλλιως τρωτε φαπες και κυριευεται το βασιλειο σας", "", ""],
	"princess00100": ["Αποφασιζεις να πολεμησεις μαζι τους, φημιζεσαι για τα χαστουκια σου και το βαρυ σου χερι. Σαπιζεις τον εχθρο τοσο πολυ που φευγουν πισω και πλεον ο λαος τους ειναι γνωστος ως 'οι κοκκινομαγουλακηδες'. Μπραβο, εισαι σπουδαια ηγετιδα", "", ""],
	"princess00101": ["Δινεις εναν τρομερο λογο. Οι πολεμιστες σου περιμενουν να ξεκινησετε τη μαχη αλλα εσυ καθεσαι και κοιτας. Σε εμπιστευονται λιγο πιο πολυ απ οτι θα επρεπε και κανουν οτι κανεις. Κοιτανε κι αυτοι και ελπιζουν. Ο εχθρος σας βλεπει που απλα κοντοστεκεστε και κανει το ιδιο. Ο πολεμος μετατραπηκε σε μαχη βλεματος. Πρωτοποριακο.", "", ""],
	"princess00110": ["Λογικα ειναι ο προσωπικος σου φρουρος οποτε ανοιγεις. Τελικα ειναι ενας πλανωδιος πωλητης που προσπαθει να σου πουλησει ενα παραξενο μαγειρικο σκευος. Δε ξερεις πως βρεθηκε εδω μεσα σε ολο αυτο το χαμο. Την παιρνεις και αρχιζεις να φτιαχνεις σουπα. Αα ναι, τελικα κερδισατε το πολεμο, κοιτα να δεις..", "", ""],
	"princess00111": ["Δεν ανοιγεις, ο,τι και να γινει μενεις μεσα. Τελικα ηταν ο στρατηγος που ηθελε βοηθεια με τη διαταξη του στρατου. Δεν τον βοηθησες, δεν ειχε σωστη διαταξη ο στρατος και ηττηθηκατε ευκολα. Καλυτερη τυχη την επομενη φορα..", "", ""],
	"princess01000": ["Αποφασιζεις να επιτεθεις ακαριαια! Βεβαια τελικα αυτο που ειχες στη τσεπη σου δεν ηταν μαχαιρι αλλα το κουταλι απ το μεσημεριανο οποτε δε κανεις ουτε γρατζουνια. Οπως φανταζεσαι κι εσυ, σε πετανε στο μπουντρουμι για την υπολοιπη ζωη σου.", "", ""],
	"princess01001": ["περιμενεις..και περιμενεις..και περιμενεις..και περιμενεις..και περιμενεις..και περιμενεις..και περιμενεις..και περιμενεις..και περιμενεις..τι ειπαμε οτι θελαμε να κανουμε;", "", ""],
	"princess01010": ["Τους δωροδοκεις με αλογα και σπιτια και καρπους. Τελικα τους πειθεις, φευγεις και γυρνας με ενα μικρο σακο με σοκολατενια αλογα και σπιτακια και σταφιδες. Οντως αυτο συμφωνησα, δεν ειπες ψεματα, απλα εκρυψες την αληθεια", "", ""],
	"princess01011": ["Τους κανεις ιπποτες, κερδιζουν πολυ μεγαλη φημη και κυρος στο βασιλειο και γινονται οι καλυτεροι πολεμιστες σου. Ετσι μπορεσαν αυτοι να ζησουν μια πλουσιοπαροχη ζωη κι εσυ βρηκες δυο καλους υπηκοους", "", ""],
	"princess01100": ["Συνεχιζεις τη κουβεντα, ειναι ενδιαφερουσα. Ξεχνιουνται και οι αλλοι και πηγαινετε στη γειτονικη ταβερνα να συνεχισετε. Τωρα το πως απο την απαγωγη καταληξατε να μιλατε για εφευρεσεις κανεις δε ξερει. Τουλαχιστον μολις εφηυρατε την αμαξα", "", ""],
	"princess01101": ["Αρχιζεις να φωναζεις και ακους τους ανθρωπους να γυρνανε πισω. Τελικα ηταν απλα πλανωδιοι πωλητες. Οι τυποι σε κρατανε αιχμαλωτη μεχρι να κανεις τον ενα βασιλια αλλα τουλαχιστον τωρα εχεις μια ωραια κατσαρολα να σου κανει παρεα", "", ""],
	"princess01110": ["Αποφασιζεις να τους ακουσεις περιμενοντας καποια παρακληση ή κατι τετοιο. Τελικα αρχιζει ο ενας να τραγουδαει και ο αλλος να παιζει μουσικη με το στομα του. Τους κρατας σαν βασιλικους παλιατσους για να περνανε πιο ευκολα οι μερες", "", ""],
	"princess01111": ["Τους πετας στο μπουντρουμι απ ευθειας. Μετα απο χρονια τελειωνει η ποινη τους και μετα απο ενα χρονο ακομα σε βρισκουν και σου λενε για την ιδεα που ειχαν τοτε. Απ' ο,τι φαινεται εφηυραν την αμαξα κι εσυ εχασες την ευκαιρια να σε θυμαται ο κοσμος για παντα. Ατυχια..", "", ""],
	"thiefs": ["εισαι ενας κλεφτης, γρηγορος και ησυχος, σκοπος σου ειναι να περνας απαρατηρητος και να συλλεγεις χρυσο ή αλλα σημαντικα αντικειμενα", None, None],
	"thief0": ["ειναι βραδυ και βρεχει, περιπλανιεσαι εδω κι εκει χωρις λογο. Βλεπεις μια ταβερνα και μπαινεις μεσα, ολο και καποιος θα εχει γεματο πορτοφολι για να του το παρεις. Βρισκεις εναν τυπο, ειναι πολεμιστης αλλα φαινεται αρκετα αφελης. Τι κανεις;", "πλησιαζεις", "δε πλησιαζεις"],
	"thief00": ["Πλησιαζεις τον πολεμιστη και του πιανεις τη κουβεντα. Συμφωνεις σε ο,τι λεει ενω παραλληλα ψαχουλευεις τις τσεπες του και τελικα βρισκεις ενα πορτοφολι κι ενα στιλετο. Τι παιρνεις;", "πορτοφολι", "στιλετο"],
	"thief01": ["Καθεσαι στη γωνια σου και σκεφτεσαι πως θα γινεις πλουσιος, σκεφτεσαι να απαγαγεις τη πριγκιπισσα αλλα ξαφνικα ακους τον πολεμιστη να παραμιλαει για μια εξερευνηση που θα μπορουσε να αποφερει πλουτο. Ακολουθεις τον πολεμιστη ή συνεχιζεις το σχεδιο σου;", "πολεμιστης", "πριγκιπισσα"],
	"thief000": ["του παιρνεις το πορτοφολι και φευγεις. Βλεπεις οτι εχει αρκετα χρηματα για προμηθειες. Πας να τα μετρησεις αλλα ακους την πορτα να ανοιγει, ισως ειναι ο πολεμιστης. Συνεχιζεις ο,τι εκανες ή κρυβεσαι;", "συνεχιζεις", "κρυβεσαι"],
	"thief001": ["παιρνεις το στιλετο, ειναι πολυ κοφτερο και γυαλισμενο, ο,τι πρεπει για να ακολουθησεις το σχεδιο που ειχες ετοιμασει προχθες, να απαγαγεις τη πριγκιπισσα. Πας στο παλατι αλλα εχει φρουρους. Τους πολεμας ή προσπαθεις να προχωρησεις στα κρυφα;", "πολεμας", "κρυφα"],
	"thief010": ["βραδιαζει, ακολουθεις τον πολεμιστη που φευγει και το ξημερωμα συνεχιζεις πισω του, περιμενωντας να βρεις τον πλουτο που ελεγε. Βλεπεις εναν ανθρωπο να πλησιαζει τον πολεμιστη, ισως ειναι εχθρικος. Του επιτιθεσαι για να βρει ο πολεμιστης το πλουτο και να τον παρεις ή αφηνεις τον πολεμιστη να το χειριστει;", "επιτιθεσαι", "περιμενεις"],
	"thief011": ["ξεκινας λοιπον και μπαινεις στο καστρο αλλα ειναι γεματο φρουρους. Μπορεις να μπεις και να τους εξουδετερωσεις ολους εναν-εναν ή να παρεις τη στολη ενος και να περασεις ενω νομιζουν οτι εισαι ενας απο αυτους", "πολεμας", "μεταμφιεση"],
	"thief0000": ["υνεχιζεις και ειναι οντως ο πολεμιστης, σε πιανει και σε ριχνει κατω. Δε μπορεις να κουνηθεις και αυτος ειναι ετοιμος να σου δωσει ενα μαθημα. Το δεχεσαι σαν τιμωρια για την απροσεξια σου ή προσπαθεις να του χτυπησεις τα ποδια για να πεσει κατω και να ανατρεψεις τη κατασταση;", "τιμωρια", "χτυπημα"],
	"thief0001": ["κρυβεσαι πισω απο ενα δεντρο και βγαινει οντως ο πολεμιστης. Καποιος σε ειδε ομως και μπορει να σε καρφωσει. Του δινεις τα μισα χρηματα για να μεινει σιωπηλος ή τον αγνοεις κι ελπιζεις να μη πει τιποτα;", "δωροδοκεις", "αγνοεις"],
	"thief0010": ["αποφασιζεις να πολεμησεις τους φρουρους αλλα σε πιανουν αμεσως και σε πηγαινουν μπροστα στη πριγκιπισσα για να αποφασισει τι θα σου κανουν. Εισαι στο ελεος της. Προσπαθεις να δικαιολογηθεις ή περιμενεις ενα ανοιγμα για να ξεφυγεις και να επιτεθεις;", "δικαιολογεισαι", "περιμενεις"],
	"thief0011": ["αποφασιζεις να πας στα κρυφα και τα καταφερνεις, βρισκεσαι 10 μετρα μακρια απο τη πριγκιπισσα. Την πιανεις αιχμαλωτη και την απειλεις ή πας και της μιλας κι αν χρειαστει βγαζεις το μαχαιρι;", "απειλεις", "μιλας"],
	"thief0100": ["αποφασιζεις να επιτεθεις, ομως τελικα αυτος ο τυπος ειναι μαγος, ειναι επικινδυνος. Φτανεις με ελιγμους πισω του. Τον αφηνεις αναισθητο και συνεχιζετε ή τον αναγκαζεις να ερθει μαζι σας και να σας βοηθησει; οι μαγοι ειναι σοφοι και ισως υπαρχουν παγιδες μεσα", "αναισθητος", "αιχμαλωτος"],
	"thief0101": ["αφηνεις τον πολεμιστη να το χειριστει, βλεπεις οτι μιλανε αλλα τελικα πανε μαζι προς τη σπηλια. Συνεχιζεις να ακολουθεις κρυφα παρολο που ειναι δυο τωρα ή προσπαθεις κι εσυ να γινεις μελος της ομαδα τωρα που γυριζει;", "κρυφα", "φανερα"],
	"thief0110": ["τους εξουδετερωνεις ολους, ειναι ολοι στο πατωμα αλλα ο τελευταιος σε καταλαβαινει, τι κανεις; αρχιζεις και τρεχεις κρυβοντας το προσωπο σου για να μη μαθει κανεις ποιος το εκανε ή κανεις οτι καθαριζεις για να συνεχισεις προσπερνωντας τον;", "φευγεις", "καθαριζεις"],
	"thief0111": ["παιρνεις τη στολη ενος ενω κανει μπανιο, δεν πρεπει να κανεις μπανιο εν ωρα εργασιας..Τελικα σου ειναι πολυ μεγαλη, συνεχιζεις με τη στολη κι αν σε ρωτησουν λες οτι εισαι γελοτοποιος ή ψαχνεις να βρεις αλλο τροπο;", "συνεχιζεις", "ψαχνεις"],
	"thief00000": ["το δεχεσαι και ειναι χειροτερο απο οτι περιμενες, ομως ερχονται οι φρουροι, τον διακοπτουν, και πανε να τον βαλουν στο μπουντρουμι. Ωστοσο εσυ στα κρυφα βουτηξες ξανα το πορτοφολι του, συνεχιζεις τη βραδια σου με ποτο κερασμενο απο τον πολεμιστη", "", ""],
	"thief00001": ["Του ριχνεις μια κλωτσια και ανατρεπεις και αυτον και τη κατασταση. Οπως επεσε χτυπησε το κεφαλι του και επαθε αμνησια. Του λες οτι ειναι φιλος και υπηρετης σου και απο τοτε οργανωνετε σχεδια και κλεβετε μαζι", "", ""],
	"thief00010": ["ανοιγεις το πουγκι, πιανεις μερικα κερματα και του τα πετας για να τον δωροδοκισεις. Του πεφτουν ομως κατω και ξαφνικα ενα τσουρμο ανθρωπον πεταχτηκε να πιασει τα πεσμενα χρηματα. Επισης ο πολεμιστης κυνηγαει εκεινο τον τυπο τωρα. Ξεφευγεις σαν κυριος", "", ""],
	"thief00011": ["Δε λες τιποτα και ο τυπος σε καρφωνεις στον πολεμιστη δειχνοντας το δεντρο. Ο πολεμιστης μπερδευεται και νομιζει οτι εισαι πανω στο δεντρο, σκαρφαλωνει να σε πιασει και ετσι εχεις ολο το χρονο δικο σου να φυγεις. Ξεφευγεις σαν κυριος", "", ""],
	"thief00100": ["Προσπαθεις να απολογηθεις. Ζητας συγγνωμη και λες πως ηταν φαρσα. Η πριγκιπισσα πεθαινει στα γελια και σε αφηνει ελευθερο. Τωρα πια μπορεις να κανεις οτιδηποτε χωρις καμια ποινη αρκει να πεις οτι ειναι φαρσα", "", ""],
	"thief00101": ["Περιμενεις να ερθει το ανοιγμα..δεν εχει ερθει ακομα ομως. Σε εχουν πεταξει στο μπουντρουμι εδω και 4 χρονια. Αλλα το ανοιγμα θα ερθει, ξερεις οτι θα ερθει. ΠΡΕΠΕΙ να ερθει!", "", ""],
	"thief00110": ["Τελικα την πλησιαζεις και της δειχνεις το μαχαιρι. Την απειλεις οτι αν δεν σε κανει βασιλια θα μεινεις εκει και θα κοβεις κρεμμυδια μεχρι να σβησει ο ηλιος κι εκεινη θα κλαιει. Απ τον φοβο της σου δινει το μισο βασιλειο, η απειλη σου επιασε", "", ""],
	"thief00111": ["Αρχιζεις και της μιλας, κανεις τον πλανωδιο πωλητη μαχαιριων και της δειχνεις το μαχαιρι σου. Σκοπευεις να το χρησιμοποιησεις αν κατι παει στραβα αλλα τελικα στο αγοραζει για 10.000 χρυσα νομισματα κι εσυ δε χρειαζεται να ξαναδουλεψεις ποτε", "", ""],
	"thief01000": ["τον αφηνεις αναισθητο, μπαινετε στη σπηλια και τελικα βρισκετε ενα μεγαλο θησαυρο. Οπως βγαινετε, ο μαγος εχει μολις ξυπνησει. Με ενα μαγικο ξορκι σας παιρνει τον θησαυρο και εξαφανιζεται. Μπραβο..", "", ""],
	"thief01001": ["Του παιρνεις το ραβδι και τον αναγκαζεις να ερθει μαζι σας να σας βοηθησει. Βρισκετε επιτελους τον θησαυρο και απο τη χαρα σου κραυγαζεις και σηκωνεις ψηλα τα χερια σου. Κατα λαθος κανεις ενα μαγικο και εξαφανιζεις τον θησαυρο. Συγχαρητηρια..", "", ""],
	"thief01010": ["Ακολουθεις κρυφα, βρισκουν ενα σεντουκι θησαυρου και περιμενεις την καταλληλη στιγμη για να το κλεψεις. 7 χρονια περασαν και επιτελους βρηκες την ευκαιρια σου και κλεβεις το σεντουκι. Ειναι πλεον αδειο αλλα αυτο δεν εχει σημασια, τα καταφερες", "", ""],
	"thief01011": ["Πεταγεσαι κι εσυ απο το πουθενα, σαν να εφτασες εκει μολις και τους λες να πας κι εσυ μαζι τους, σε δεχονται και ξαφνικα εμφανιζεται κι αλλος και μετα κι αλλος κι αλλος κι αλλος. Κανεις δε ξερει πως καταληξατε 7000 ατομα σε μια σπηλια", "", ""],
	"thief01100": ["Γυρνας αποτομα να μη δει ποιος εισαι και πας να τρεξεις αλλα χτυπας σε μια κολωνα και πεφτεις αναισθητος. Οταν ανοιγεις τα ματια σου παλι ανακαλυπτεις οτι ο φρουρος πεθανε απο το γελιο. Συνεχιζεις ανενοχλητος, φτανεις στη πριγκιπισσα και καταφερνεις να της παρεις το θρονο", "", ""],
	"thief01101": ["χρησιμοποιεις το σπαθι ενος φρουρου σαν σκουπα και κανεις οτι καθαριζεις ενω σφυρας. Ευτυχως περνας απο το φρουρο αλλα σε βλεπει η πριγκιπισσα και σε βαζει να καθαρισεις ολο το παλατι. 2 φορες..", "", ""],
	"thief01110": ["Συνεχιζεις αλλα κατα λαθος πατας τη στολη σου, πεφτεις και χτυπας το κεφαλι σου. Οταν ξυπνας εχεις παθει αμνησια, βλεπεις τα ρουχα σου και νομιζεις οτι εισαι οντως φρουρος. Περνας την υπολοιπη ζωη σου προστατευοντας το βασιλειο.", "", ""],
	"thief01111": ["Συνεχιζεις να ψαχνεις. Τελικα βρισκεις μια μυστικη εισοδο/εξοδο για το παλατι. Πουλας τη πληροφορια σε ενα εχθρικο βασιλειο. Το βασιλειο σου κυριευεται μεσα σε μια μερα αλλα εσυ εισαι πλεον πλουσιος και δε σε νοιαζει", "", ""],
	"wizards": ["εισαι ενας μαγος, το πιο σοφο απ' ολα τα ειδη, προτεραιοτητα σου ειναι να βοηθας με τη γνωση σου οποιον ειναι δικαιος και σωστος", None, None],
	"wizard0": ["Εισαι ενας πολυ σοφος μαγος, για χρονια διαβαζεις για ξορκια και φιλτρα αλλα κουραστικες και θες να ξεσκασεις. Θα επισκεφθεις τον παλιο σου φιλο που ειναι κι αυτος μαγος ή θα πας για εξερευνηση;", "φιλος", "εξερευνηση"],
	"wizard00": ["φτανεις στον φιλο σου που ειναι κι αυτος μαγος. Ομως νιωθεις μια σκοτεινη δυναμη και ξαφνικα εμφανιζεται μπροστα σου, το κακο τον εχει κυριευσει. Τον πολεμας ή τον συνεφερνεις;", "πολεμας", "συνεφερνεις"],
	"wizard01": ["Ενω καβαλας το αλογο σου, βλεπεις μια σπηλια, εναν πολεμιστη να τη πλησιαζει και σε αποσταση ασφαλειας ενα μικροσωμο τυπο να τον ακολουθει στα κρυφα. Προειδοποιεις τον πολεμιστη ή παρακολουθεις τη συνεχεια;", "προειδοποιεις", "παρακολουθεις"],
	"wizard000": ["παλευεται για αρκετη ωρα αλλα κανεις δεν εχει προβαδισμα. Ειστε κι οι 2 κουρασμενοι αλλα δε θα αντεξεις πολυ. Θυμασαι ενα μαγικο ξορκι που ή θα τον συνεφερει ή θα καταστρεψει τα κοκαλα του, κανεις το ξορκι ή προσπαθεις να τον ακινητοποιησεις;", "ξορκι", "ακινητοποιεις"],
	"wizard001": ["κανεις ενα μικρο ξορκι για να διωξεις το κακο, δε γινεται τιποτα ομως. Σε χτυπαει, σπρωχνει και πεταει κατω, εχεις σχεδον πεσει απο ενα γκρεμο. Ο μονος τροπος να σωθεις ειναι να τον πεταξεις ξαφνικα εσυ και μετα να σηκωθεις, τι κανεις;", "πετας", "πεφτεις"],
	"wizard010": ["Καταλαβαινεις οτι ο ανθρωπος πισω ετοιμαζει κατι υπουλο. Με τα μαγικα σου καλεις ανεμο και κανεις τον πολεμιστη να γυρισει και να δει τον κλεφτη. Ετοιμαζονται να παλεψουν. Τους αφηνεις ή τους σταματας;", "αφηνεις", "σταματας"],
	"wizard011": ["Βλεπεις τα 2 αυτα ατομα να μπαινουν σε μια σπηλια, πραγμα παραξενο, αποφασιζεις να τους ακολουθησεις ησυχα. Οταν τους φτανεις τους βλεπεις να παλευουν με ενα τεραστιο ξωτικο ενω πισω υπαρχει ενας μεγαλος θησαυρος. Τους εξουδετερωνεις ολους και παιρνεις το θησαυρο ή βοηθας τους ανθρωπους;", "εξουδετερωνεις", "βοηθας"],
	"wizard0000": ["κανεις το ξορκι και ελπιζεις για το καλυτερο. Οσο εκτελεις το ξορκι κατι φαινεται να πηγαινει λαθος, φοβασαι οτι δε θα πιασει, σταματας ή συνεχιζεις;", "σταματας", "συνεχιζεις"],
	"wizard0001": ["προσπαθεις να τον ακινητοποιησεις. Προφανως ο πιο καλος τροπος να το κανεις αυτο ειναι με αγκαλια. Τον πιανεις και τον σφιγγεις αλλα τον ακους να ψιθυριζει καποιο ξορκι. Τον αφηνεις ή συνεχιζεις και ελπιζεις στη δυναμη της φιλιας;", "αφηνεις", "ελπιζεις"],
	"wizard0010": ["του βαζεις τρικλοποδια και μετα με ενα γρηγορο ξορκι τον σπρωχνεις προς το κενο. Τον ακους και πεφτει...και πεφτει...και πεφτει..Τελικα εχει πιαστει ο μανδυας του σε ενα βραχο και δε μπορει να κουνηθει. Τον αφηνεις εκει ή προσπαθεις να τον κατεβασεις και να τον συνεφερεις;", "αφηνεις", "κατεβαζεις"],
	"wizard0011": ["αποφασιζεις να πεσεις στο κενο, πρεπει καπως να σωθεις ομως και γρηγορα..μπορεις ειτε να κανεις ενα μαγικο για να μειωσεις τη βαρυτητα και να επιβραδυνεις τη πτωση ή να χρησιμοποιησεις τον μεγαλο σου μανδυα σαν αεροστατο, ανοιγωντας το ωστε να υπαρχει αντισταση στον αερα. Τι κανεις;", "βαρυτητα", "αεροστατο"],
	"wizard0100": ["τους αφηνεις να παλεψουν, δεν ειναι δικη σου υποθεση, στο μεταξυ εχεις την ευκαιρια να παρακολουθησεις τη μαχη ή να πας προς τη σπηλια που κατευθυνονταν, να δεις γιατι ειναι τοσο ενδιαφερουσα. Τι κανεις;", "παρακολουθεις", "σπηλια"],
	"wizard0101": ["ακινητοποιεις και τους δυο και βλεπεις το κινητρο του καθενος, εχουν παρομοια συμφεροντα αλλα συγκρουονται μεταξυ τους. Δυο τροποι μπορουν να λυσουν το προβλημα. Θα του συμφιλιωσεις ή θα παιξουν πετρα-ψαλιδι-χαρτι και οποιος κερδισει, σαν πραγματικοι αντρες. Τι επιλεγεις;", "συμφιλιωση", "παιχνιδι"],
	"wizard0110": ["δε σε νοιαζει τιποτα περα απο το σεντουκι. Με ενα χτυπημα του ραβδιου σου τους μετατρεπεις ολους σε βατραχους και πας προς αυτο. Παρατηρεις ομως οτι για καποιο λογο ακομα παλευουν μεταξυ τους, τους αγνοεις ή τους παρατηρεις γεματος περιεργεια;", "αγνοεις", "παρατηρεις"],
	"wizard0111": ["πας να βοηθησεις τους ανθρωπους, φαινεται ομως κακη ιδεα, μαλλον θα τις φατε και οι 3, εχεις την επιλογη να αλλαξεις πλευρα και να βοηθησεις το ξωτικο και να συμφιλιωθειτε. Συμφιλιωνεσαι με το ξωτικο ή παραμενεις στο πλευρο τον ανθρωπων;", "ξωτικο", "ανθρωποι"],
	"wizard00000": ["Σταματας το ξορκι, τελικα ομως ηταν απλα ιδεα σου, πηγαινε μια χαρα. Ξαναξεκινας το ξορκι. Ξανασταματας το ξορκι. Ξαναξεκινας το ξορκι. Ξανασταματας το ξορκι. Αυτο γινεται εδω και 2 μερες, δε μπορεις να αποφασισεις..", "", ""],
	"wizard00001": ["τελικα συνεχιζεις. Αλλα οντως κατι πηγε λαθος...κατι εκανες και τον μετετρεψες σε βατραχο..Αντε τωρα να βρισκεις πριγκιπισσα να τον φιλισει και προξενια κι ιστοριες...αποφασιζεις να πας για μπυρες.", "", ""],
	"wizard00010": ["τον αφηνεις, τωρα ομως νιωθει προδομενος απο τη φιλια σου και πως δε νοιαζεσαι. Φευγει με σκυμμενο το κεφαλι ενω ευχεται να μην σε ηξερε. Μπραβο..", "", ""],
	"wizard00011": ["ελπιζεις στη δυναμη της φιλιας. Τοσο πολυ που ουρανος γινεται ροζ και εμφανιζονται γυρω σας τα αρκουδακια της αγαπης. Σε βοηθανε να τον σαπισετε στο ξυλο και να μαθει το μαθημα του", "", ""],
	"wizard00100": ["τον αφηνεις εκει και αποφασιζεις να πας στη κοντινοτερη ταβερνα, ετσι κι αλλιως δε μπορει να φυγει, εχει πιαστει ο μανδυας του. Οταν γυρνας πισω να σιγουρευτεις οτι ολα πανε καλα, βλεπεις οτι λειπουν ολα τα πουλια που ηταν εκει. Και να πως ανακαλυφθηκε το σκιαχτρο", "", ""],
	"wizard00101": ["Απο τη καλη σου τη καρδια τον κατεβαζεις. Αφου πρωτα ομως σου υποσχεθει οτι θα κερασει τις επομενες 5 φορες. Προφανως πατε κατευθειαν για μπυρες στη ταβερνα και γινεσαι τυφλα", "", ""],
	"wizard00110": ["Κανεις το μαγικο ξορκι για να μειωσεις τη βαρυτητα, κατι εκανες λαθος ομως επειδη ησουν αγχωμενος και τελικα τν αυξησες. Χτυπας στο εδαφος με τοση δυναμη μου κανεις τρυπα και βγαινεις στην αλλη ακρη της γης. Και αυτη ειναι η ιστορια του πως ανακαλυψες τη Κινα", "", ""],
	"wizard00111": ["Ανοιγεις τον μανδυα σου με τετοιο τροπο που μειωνει τη πτωση. Προσγειωνεσαι σωος και ανεβαινεις ξανα στη κορυφη να συνεχισετε τη μαχη..αλλα σε ξαναριχνει..Βαριεσαι να ξανανεβεις και απο τοτε απλα φωναζετε ο ενας στον αλλο απο αποσταση", "", ""],
	"wizard01000": ["παρακολουθεις, με ενα μαγικο εχεις και ποπ-κορν για οσο παλευουν. Αλλα η μαχη ειναι αρκετα ιση, σε παιρνει ο υπνος. Οταν ξυπνας ανακαλυπτεις οτι συμφιλιωθηκαν και σε εχουν δεσει. Σε κρατανε αιχμαλωτο και σε βαζουν να δημιουργεις πυροτεχνηματα ξανα και ξανα για χρονια.", "", ""],
	"wizard01001": ["Μπαινεις στα κρυφα στη σπηλια. Με ενα μαγικο ριχνεις ενα βραχο στην εισοδο και δε μπορουν να μπουν. Συνεχιζεις και βρισκεις εναν θησαυρο. Τον παιρνεις και πας να φυγεις αλλα θυμασαι οτι εκλεισες τον εαυτο σου μεσα. Περιμενεις καθιστος μεχρι να ερθει καποιος να ανοιξει τη πυλη, καλη τυχη", "", ""],
	"wizard01010": ["αποφασιζεις να τους συμφιλιωσεις. Ολοι ξερουν ποιος ειναι ο καλυτερος τροπος. Παρτυ με τσαι και κουλουρακια! ενω πινετε το τσαι, καθεστε και συζητατε για το ποια ειναι η τελεταια λεξη της μοδας στη στολες των φρουρων.", "", ""],
	"wizard01011": ["Τους βαζεις να παιξουν πετρα-ψαλιδι-χαρτι στα τρια. Οσο τους βλεπεις ζηλευεις και αποφασιζεις οτι ο νικητης θα παιξει μαζι σου. Σας αποροφαει τοσο πολυ ολο αυτο που καθεστε ολο το βραδυ και κανετε πρωταθληματακια πετρα-ψαλιδι-χαρτι", "", ""],
	"wizard01100": ["τους αγνοεις και παιρνεις επιτελους τον θησαυρο. Γυρνας να φυγεις και βλεπεις οτι καπως καταφεραν και εδεσαν μεταξυ τους τις γλωσσες τους...το εκμεταλευεσαι και τους χρησιμοποιεις σαν λασο στις μελλοντικες σου περιπετειες", "", ""],
	"wizard01101": ["καθεσαι και τους παρατηρεις να παλευουν. Προτου το καταλαβεις εχουν περασει 3 ωρες και ακομα καθεσαι και τους βλεπεις. Τρομερο θεαμα! Παιρνεις τους βατραχους και απο τοτε γυρνας απο πολη σε πολη, ολοι σε χρυσοπληρωνουν για να δουν αυτη τη μοναδικη παρασταση και χαρη σε αυτο εισαι πλουσιος", "", ""],
	"wizard01110": ["παρατας τους ανθρωπους, ποιος νοιαζεται; συμφιλιωνεσαι με το ξωτικο και τους διωχνετε. Μετα κανεις μια δικαιη συμφωνια με αυτο, σου δινει το θησαυρο που φυλαει και του δινεις ενα μεγαλο κλαδι και το καπελο σου. Φευγεις σαν κυριος απο τη σπηλια", "", ""],
	"wizard01111": ["Συνεχιζεις να πολεμας στο πλευρο των ανθρωπων αλλα ματαια, ειστε πολυ αδυναμοι. Λες οτι θα πας απο πισω απ το ξωτικο να το αιφνιδιασεις. Η αληθεια ειναι οτι προχωρησες, πηρες το θησαυρο και εφυγες. Δεν εχεις ιδεα τι απεγιναν οι αλλοι", "", ""]


}

pygame.init()

screenx = 1100
screeny = 750

current = None

gameDisplay = pygame.display.set_mode((screenx, screeny))

white = (255, 255, 255)
light_red = (255, 0, 0)
light_green = (0, 255, 0)
light_blue = (0, 0, 255)
light_brown = (189, 119, 69)
light_yellow = (0, 255, 255)
yellow = (0, 200, 200)
blue = (0, 0, 200)
brown = (139,69,19)
red = (200, 0, 0)
green = (0, 200, 0)

pygame.display.set_caption("Το Μονοπατι των Τεσσαρων Οριζοντων")

clock = pygame.time.Clock()

def text_objects(text, font):
	textSurface = font.render(text, True, (0, 0, 0))
	return textSurface, textSurface.get_rect()

def message_display(text):
	message = pygame.font.SysFont('gabriola', 35)

	pos1 = len(text)//3
	if text[pos1] != " ":
		while text[pos1] != " ":
			pos1 += 1

	pos2 = pos1 + len(text)//3
	if text[pos2] != " ":
		while text[pos2] != " ":
			pos2 += 1

	textSurf, textRect = text_objects(text[:pos1], message)
	textRect.center = (screenx/2, screeny/(2+0.4))
	gameDisplay.blit(textSurf, textRect)

	textSurf, textRect = text_objects(text[pos1:pos2], message)
	textRect.center = (screenx/2, screeny/(2+0.2))
	gameDisplay.blit(textSurf, textRect)

	textSurf, textRect = text_objects(text[pos2:], message)
	textRect.center = (screenx/2, screeny/2)
	gameDisplay.blit(textSurf, textRect)

def button(msg, buttonx, width, buttony, height, nrm_color, light_color, action=None, current_stat = None):
	mouse = pygame.mouse.get_pos()
	click = pygame.mouse.get_pressed()

	if buttonx+width > mouse[0] > buttonx and buttony+height > mouse[1] > buttony:
		pygame.draw.rect(gameDisplay, light_color, (buttonx, buttony, width, height))
		for event in pygame.event.get():
			if event.type == pygame.MOUSEBUTTONDOWN:
				# 1 is the left mouse button, 2 is middle, 3 is right.
				if event.button == 1:
					if action == "info":
						info()
					if action == "quit":
						pygame.quit()
						quit()
					if action == "play":
						game_intro()
					if action == "menu":
						main_menu()
					if action == "intro":
						game_loop()
					if action == "introw":
						current = "warriors"
						char_intro(current)
					if action == "introp":
						current = "princesss"
						char_intro(current)
					if action == "introt":
						current = "thiefs"
						char_intro(current)
					if action == "introm":
						current = "wizards"
						char_intro(current)
					if action == "story":
						story_loop(current_stat)
					if action == "left":
						current_stat += "0"
						if current_stat[-6] == "0" or current_stat[-6] == "1":
							final_screen()
						else:
							story_loop(current_stat)
					if action == "right":
						current_stat += "1"
						if current_stat[-6] == "0" or current_stat[-6] == "1":
							final_screen()
						else:
							story_loop(current_stat)
	else:
		pygame.draw.rect(gameDisplay, nrm_color, (buttonx, buttony, width, height))

	smallText = pygame.font.SysFont("gabriola", 25)
	textSurf, textRect = text_objects(msg, smallText)
	textRect.center = (buttonx+width/2, buttony+height/2)
	gameDisplay.blit(textSurf, textRect)
	

def main_menu():
	intro = True
	
	while True:
		gameDisplay.fill(white)
		message = "Το μονοπατι των τεσσαρων οριζοντων"
			
		message_display(message)
		

		button("Παιξε!", 180, 100, 550, 50, green, light_green, "play", None)
		button("Πληροφοριες", 510, 100, 550, 50, yellow, light_yellow, "info", None)
		button("Εξοδος", 880, 100, 550, 50, red, light_red, "quit", None)


		
		pygame.display.update()
		
		for event in pygame.event.get():
			if event.type == pygame.QUIT:
				pygame.quit()
				quit()
					

def info():
	while True:
		gameDisplay.fill(white)
		message = "Αυτο ειναι ενα παιχνιδι/ιστορια, δημιουργημενο απο τον Γιωργο Τσαλαμαγκακη, η οποια σου δειχνει ποσο πολλες δυνατοτητες εχει μια συνθηκη 'Αν' και ποσο μπορει να αλλαξει τη πορεια των πραγματων. Ηξερες οτι αυτο το παιχνιδι εχει 64 διαφορετικα τελη; Καλη διασκεδαση!"

		message_display(message)

		button("Πισω", 510, 100, 550, 50, red, light_red, "menu", None)


		
		pygame.display.update()
		
		for event in pygame.event.get():
			if event.type == pygame.QUIT:
				pygame.quit()
				quit()
	
	
def game_intro():

	while True:
		gameDisplay.fill(white)
		message = "Διαλεξε τον χαρακτηρα σου!"

		message_display(message)

		button("Πολεμιστης", 120, 100, 550, 50, green, light_green, "introw", None)
		button("Κλεφτης", 370, 100, 550, 50, brown, light_brown, "introt", None)
		button("Πριγκιπισσα", 640, 100, 550, 50, red, light_red, "introp", None)
		button("Μαγος", 880, 100, 550, 50, blue, light_blue, "introm", None)


		
		pygame.display.update()
		
		for event in pygame.event.get():
			if event.type == pygame.QUIT:
				pygame.quit()
				quit()

def char_intro(current):

	while True:
		gameDisplay.fill(white)
		message = story[current][0]
		new_current = ""

		message_display(message)
		for i in range(len(current)-1):
			new_current += current[i]
		new_current += "0"

		button("Συνεχισε", 510, 100, 550, 50, green, light_green, "story", new_current)


		
		pygame.display.update()
		
		for event in pygame.event.get():
			if event.type == pygame.QUIT:
				pygame.quit()
				quit()

def story_loop(current):

	while True:
		gameDisplay.fill(white)
		message = story[current][0]

		message_display(message)

		button(story[current][1], 120, 100, 550, 50, green, light_green, "left", current)
		button(story[current][2], 880, 100, 550, 50, red, light_red, "right", current)

		pygame.display.update()
		
		for event in pygame.event.get():
			if event.type == pygame.QUIT:
				pygame.quit()
				quit()

def final_screen():
	while True:
		gameDisplay.fill(white)
		message = "Αυτο ηταν το παιχνιδι, ελπιζω να σου αρεσε! και μη ξεχνας, αυτο ηταν μονο ενα απο τα 64 διαφορετικα τελη, πηγαινε να δεις και τα υπολοιπα!"

		message_display(message)

		button("Ξαναπαιξε!", 510, 100, 550, 50, green, light_green, "menu", None)

		pygame.display.update()
		
		for event in pygame.event.get():
			if event.type == pygame.QUIT:
				pygame.quit()
				quit()

main_menu()	